rco123/esp32AiCar/app_server.h
#ifndef APP_SERVER_H
#define APP_SERVER_H

// Define Servo PWM Values & Stopped Variable
int speed = 100;
int trim = 0;

// Libraries. If you get errors compiling, please downgrade ESP32 by Espressif.
// Use version 1.0.2 (Tools, Manage Libraries).
#include <esp32-hal-ledc.h>
#include "esp_http_server.h"
#include "esp_timer.h"
#include "esp_camera.h"
#include "img_converters.h"
#include "Arduino.h"
#include "lib/dl_lib.h"
#include "SetMotor.h"
#include "jsonContws.h"

// #include <Arduino.h>
// #include <ArduinoJson.h>
// #include <WiFi.h>
// #define LED_BUILTIN 4


// 전역 변수 선언
volatile int client_count = 0;
SemaphoreHandle_t client_count_semaphore;
TaskHandle_t capture_task_handle = NULL;
volatile bool capture_task_running = false;


camera_fb_t *shared_fb = NULL;
SemaphoreHandle_t xSemaphore = NULL;  // 동기화를 위한 세마포어

static esp_err_t send_frame(httpd_req_t *req); // 프로토타입 선언
void capture_frame(void* param);

extern esp_err_t ws_handler(httpd_req_t *req);


// Stream Encoding
typedef struct {
  httpd_req_t *req;
  size_t len;
} jpg_chunking_t;

#define PART_BOUNDARY "123456789000000000000987654321"
static const char *_STREAM_CONTENT_TYPE = "multipart/x-mixed-replace;boundary=" PART_BOUNDARY;
static const char *_STREAM_BOUNDARY = "\r\n--" PART_BOUNDARY "\r\n";
static const char *_STREAM_PART = "Content-Type: image/jpeg\r\nContent-Length: %u\r\n\r\n";
httpd_handle_t stream_httpd = NULL;
httpd_handle_t alt_stream_httpd = NULL;
httpd_handle_t camera_httpd = NULL;
httpd_handle_t cmd_httpd = NULL;
httpd_handle_t ws_httpd = NULL;


static size_t jpg_encode_stream(void *arg, size_t index, const void *data, size_t len) {
  jpg_chunking_t *j = (jpg_chunking_t *)arg;
  if (!index) {
    j->len = 0;
  }
  if (httpd_resp_send_chunk(j->req, (const char *)data, len) != ESP_OK) {
    return 0;
  }
  j->len += len;
  return len;
}

static esp_err_t capture_handler(httpd_req_t *req) {
  camera_fb_t *fb = NULL;
  esp_err_t res = ESP_OK;
  int64_t fr_start = esp_timer_get_time();

  fb = esp_camera_fb_get();
  if (!fb) {
    Serial.println("Camera capture failed");
    httpd_resp_send_500(req);
    return ESP_FAIL;
  }

  httpd_resp_set_type(req, "image/jpeg");
  httpd_resp_set_hdr(req, "Content-Disposition", "inline; filename=capture.jpg");

  size_t out_len, out_width, out_height;
  uint8_t *out_buf;
  bool s;
  {
    size_t fb_len = 0;
    if (fb->format == PIXFORMAT_JPEG) {
      fb_len = fb->len;
      res = httpd_resp_send(req, (const char *)fb->buf, fb->len);
    } else {
      jpg_chunking_t jchunk = { req, 0 };
      res = frame2jpg_cb(fb, 80, jpg_encode_stream, &jchunk) ? ESP_OK : ESP_FAIL;
      httpd_resp_send_chunk(req, NULL, 0);
      fb_len = jchunk.len;
    }
    esp_camera_fb_return(fb);
    int64_t fr_end = esp_timer_get_time();
    Serial.printf("JPG: %uB %ums\n", (uint32_t)(fb_len), (uint32_t)((fr_end - fr_start) / 1000));
    return res;
  }

  dl_matrix3du_t *image_matrix = dl_matrix3du_alloc(1, fb->width, fb->height, 3);
  if (!image_matrix) {
    esp_camera_fb_return(fb);
    Serial.println("dl_matrix3du_alloc failed");
    httpd_resp_send_500(req);
    return ESP_FAIL;
  }

  out_buf = image_matrix->item;
  out_len = fb->width * fb->height * 3;
  out_width = fb->width;
  out_height = fb->height;

  s = fmt2rgb888(fb->buf, fb->len, fb->format, out_buf);
  esp_camera_fb_return(fb);
  if (!s) {
    dl_matrix3du_free(image_matrix);
    Serial.println("to rgb888 failed");
    httpd_resp_send_500(req);
    return ESP_FAIL;
  }

  jpg_chunking_t jchunk = { req, 0 };
  s = fmt2jpg_cb(out_buf, out_len, out_width, out_height, PIXFORMAT_RGB888, 90, jpg_encode_stream, &jchunk);
  dl_matrix3du_free(image_matrix);
  if (!s) {
    Serial.println("JPEG compression failed");
    return ESP_FAIL;
  }

  int64_t fr_end = esp_timer_get_time();
  return res;
}




// WebSocket 핸들러
// static esp_err_t ws_handler(httpd_req_t *req) {
//     if (req->method == HTTP_GET) {
//         return ESP_OK;
//     }

//     httpd_ws_frame_t ws_pkt;
//     memset(&ws_pkt, 0, sizeof(httpd_ws_frame_t));
//     ws_pkt.type = HTTPD_WS_TYPE_TEXT;

//     // WebSocket 데이터 수신
//     esp_err_t ret = httpd_ws_recv_frame(req, &ws_pkt, 0);
//     if (ret != ESP_OK) {
//         Serial.println("Failed to get frame length");
//         return ret;
//     }

//     char *buf = (char *)malloc(ws_pkt.len + 1);
//     if (!buf) {
//         Serial.println("Failed to allocate memory for WebSocket buffer");
//         return ESP_ERR_NO_MEM;
//     }

//     ws_pkt.payload = (uint8_t *)buf;
//     ret = httpd_ws_recv_frame(req, &ws_pkt, ws_pkt.len);
//     if (ret == ESP_OK) {
//         buf[ws_pkt.len] = '\0';  // Null-terminate the payload
//         Serial.printf("Received WebSocket message: %s\n", buf);

//         // JSON 데이터 처리
//         StaticJsonDocument<256> jsonDoc;
//         DeserializationError error = deserializeJson(jsonDoc, buf);
//         if (error) {
//             Serial.print("JSON parse error: ");
//             Serial.println(error.c_str());
//         } else {
//             const char *action = jsonDoc["action"];
//             const char *state = jsonDoc["state"];
            
//             // JSON 동작 처리 예시
//             if (strcmp(action, "led") == 0) {
//                 if (strcmp(state, "on") == 0) {
//                     digitalWrite(LED_BUILTIN, HIGH);
//                     Serial.println("LED is ON");
//                 } else if (strcmp(state, "off") == 0) {
//                     digitalWrite(LED_BUILTIN, LOW);
//                     Serial.println("LED is OFF");
//                 }
//             }
//         }

//         // 클라이언트에 응답 메시지 보내기
//         httpd_ws_frame_t ws_res;
//         ws_res.type = HTTPD_WS_TYPE_TEXT;
//         const char *response = "Message received";
//         ws_res.payload = (uint8_t *)response;
//         ws_res.len = strlen(response);
//         httpd_ws_send_frame(req, &ws_res);
//     }

//     free(buf);
//     return ret;
// }



// stream_handler 수정
static esp_err_t stream_handler(httpd_req_t *req) {
    esp_err_t res = ESP_OK;

    // 클라이언트 수 증가
    if (xSemaphoreTake(client_count_semaphore, portMAX_DELAY)) {
        client_count++;
        if (client_count == 1) {
            // 첫 번째 클라이언트가 연결되었으므로 캡처 태스크 시작
            if (capture_task_handle == NULL) {
                capture_task_running = true;  // 플래그를 true로 설정
                xTaskCreate(capture_frame, "capture_frame", 4096, NULL, 1, &capture_task_handle);
            }
        }
        xSemaphoreGive(client_count_semaphore);
    }

    httpd_resp_set_type(req, _STREAM_CONTENT_TYPE);
    while (true) {
        if (send_frame(req) != ESP_OK) {
            break;
        }
    }

    // 클라이언트 수 감소
    if (xSemaphoreTake(client_count_semaphore, portMAX_DELAY)) {
        client_count--;
        if (client_count == 0) {
            // 마지막 클라이언트가 연결을 해제했으므로 캡처 태스크 중지
            if (capture_task_handle != NULL) {
                capture_task_running = false;  // 플래그를 false로 설정
                xSemaphoreGive(client_count_semaphore);  // 세마포어 해제
                // 태스크가 종료될 시간을 주기 위해 지연
                vTaskDelay(pdMS_TO_TICKS(100));
                capture_task_handle = NULL;
            } else {
                xSemaphoreGive(client_count_semaphore);  // 세마포어 해제
            }
        } else {
            xSemaphoreGive(client_count_semaphore);  // 세마포어 해제
        }
    }

    return ESP_OK;
}

