rco123/esp32AiCar/app_server.h
// stream_handler 수정
static esp_err_t alt_stream_handler(httpd_req_t *req) {
    esp_err_t res = ESP_OK;

    // 클라이언트 수 증가
    if (xSemaphoreTake(client_count_semaphore, portMAX_DELAY)) {
        client_count++;
        if (client_count == 1) {
            // 첫 번째 클라이언트가 연결되었으므로 캡처 태스크 시작
            if (capture_task_handle == NULL) {
                capture_task_running = true;  // 플래그를 true로 설정
                xTaskCreate(capture_frame, "capture_frame", 4096, NULL, 1, &capture_task_handle);
            }
        }
        xSemaphoreGive(client_count_semaphore);
    }

    httpd_resp_set_type(req, _STREAM_CONTENT_TYPE);
    while (true) {
        if (send_frame(req) != ESP_OK) {
            break;
        }
    }

    // 클라이언트 수 감소
    if (xSemaphoreTake(client_count_semaphore, portMAX_DELAY)) {
        client_count--;
        if (client_count == 0) {
            // 마지막 클라이언트가 연결을 해제했으므로 캡처 태스크 중지
            if (capture_task_handle != NULL) {
                capture_task_running = false;  // 플래그를 false로 설정
                xSemaphoreGive(client_count_semaphore);  // 세마포어 해제
                // 태스크가 종료될 시간을 주기 위해 지연
                vTaskDelay(pdMS_TO_TICKS(100));
                capture_task_handle = NULL;
            } else {
                xSemaphoreGive(client_count_semaphore);  // 세마포어 해제
            }
        } else {
            xSemaphoreGive(client_count_semaphore);  // 세마포어 해제
        }
    }

    return ESP_OK;
}


static esp_err_t send_frame(httpd_req_t *req) {
    esp_err_t res = ESP_OK;
    size_t _jpg_buf_len = 0;
    uint8_t *_jpg_buf = NULL;
    char part_buf[64];

    // Take the semaphore to access shared_fb
    if (xSemaphoreTake(xSemaphore, portMAX_DELAY)) {
        if (shared_fb) {
            _jpg_buf_len = shared_fb->len;
            // Allocate memory for the frame copy
            _jpg_buf = (uint8_t *)malloc(_jpg_buf_len);
            if (_jpg_buf) {
                memcpy(_jpg_buf, shared_fb->buf, _jpg_buf_len);
            } else {
                Serial.println("Failed to allocate memory for frame copy");
                res = ESP_ERR_NO_MEM;
            }
        } else {
            // 프레임이 없는 경우 약간의 지연 후 다시 시도
            xSemaphoreGive(xSemaphore);
            vTaskDelay(pdMS_TO_TICKS(10));
            return ESP_OK;
        }
        // Release the semaphore
        xSemaphoreGive(xSemaphore);
    } else {
        Serial.println("Failed to take semaphore");
        res = ESP_FAIL;
    }

    if (res == ESP_OK && _jpg_buf) {
        // Send the frame to the client
        size_t hlen = snprintf(part_buf, sizeof(part_buf), _STREAM_PART, _jpg_buf_len);
        res = httpd_resp_send_chunk(req, part_buf, hlen);
        if (res == ESP_OK) {
            res = httpd_resp_send_chunk(req, (const char *)_jpg_buf, _jpg_buf_len);
        }
        if (res == ESP_OK) {
            res = httpd_resp_send_chunk(req, _STREAM_BOUNDARY, strlen(_STREAM_BOUNDARY));
        }
        // Free the copied frame buffer
        free(_jpg_buf);
    }

    return res;
}


void capture_frame(void* param) {
    while (capture_task_running) {
        if (xSemaphoreTake(xSemaphore, portMAX_DELAY)) {
            if (shared_fb) {
                esp_camera_fb_return(shared_fb);  // 이전 프레임 반환
            }
            shared_fb = esp_camera_fb_get();  // 새로운 프레임 가져오기
            if (!shared_fb) {
                Serial.println("Failed to capture frame");
            } else {
                Serial.printf("Captured frame: %u bytes\n", shared_fb->len);
            }
            xSemaphoreGive(xSemaphore);
        }
        vTaskDelay(pdMS_TO_TICKS(10));  // 필요한 경우 지연 조정
    }

    // 태스크 종료 전 정리 작업
    if (xSemaphoreTake(xSemaphore, portMAX_DELAY)) {
        if (shared_fb) {
            esp_camera_fb_return(shared_fb);
            shared_fb = NULL;
        }
        xSemaphoreGive(xSemaphore);
    }

    Serial.println("Capture task stopping");
    vTaskDelete(NULL);  // 태스크 종료
}


// Control Handling from Server
// Setup states of motion for Scout
enum state { fwd,
             rev,
             stp };
state actstate = stp;

static esp_err_t cmd_handler(httpd_req_t *req) {
  char *buf;
  size_t buf_len;
  char variable[32] = {
    0,
  };
  char value[32] = {
    0,
  };

  buf_len = httpd_req_get_url_query_len(req) + 1;
  if (buf_len > 1) {
    buf = (char *)malloc(buf_len);
    if (!buf) {
      httpd_resp_send_500(req);
      return ESP_FAIL;
    }
    if (httpd_req_get_url_query_str(req, buf, buf_len) == ESP_OK) {
      if (httpd_query_key_value(buf, "var", variable, sizeof(variable)) == ESP_OK && httpd_query_key_value(buf, "val", value, sizeof(value)) == ESP_OK) {
      } else {
        free(buf);
        httpd_resp_send_404(req);
        return ESP_FAIL;
      }
    } else {
      free(buf);
      httpd_resp_send_404(req);
      return ESP_FAIL;
    }
    free(buf);
  } else {
    httpd_resp_send_404(req);
    return ESP_FAIL;
  }

  int val = atoi(value);
  sensor_t *s = esp_camera_sensor_get();
  int res = 0;

  if (!strcmp(variable, "framesize")) {
    Serial.println("framesize");
    if (s->pixformat == PIXFORMAT_JPEG) res = s->set_framesize(s, (framesize_t)val);
  } else if (!strcmp(variable, "quality")) {
    Serial.println("quality");
    res = s->set_quality(s, val);
  }
  //Remote Control
  else if (!strcmp(variable, "flash"))  //LED flashing
  {
    ledcWrite(7, val);   
  } else if (!strcmp(variable, "speed"))  //Speed settings
  {
    if (val > 8) val = 8;
    else if (val < 0) val = 0;
    speed = val * 31;
  } else if (!strcmp(variable, "trim"))  //trim
  {
    if (val > 32) val = 32;
    else if (val < -32) val = -32;
    trim = val;
  } else if (!strcmp(variable, "car")) {
    if (val == 1)  //Forward
    {

      int speed1 = 0, speed2 = 0;
      speed1 = speed - trim;
      speed2 = speed + trim;
      if (speed1 < 0) speed1 = 0;
      if (speed2 < 0) speed2 = 0;
      if (speed1 > 255) speed1 = 255;
      if (speed2 > 255) speed2 = 255;
//      Serial.println("Forward");
      actstate = fwd;  // Set state to modify left & right behavior while moving.
                       // Car_forward();
      i2c_Write(M1_PWM, speed1);
      i2c_Write(M1_IN, 0);
      i2c_Write(M2_PWM, 0);
      i2c_Write(M2_IN, speed2);
    } else if (val == 2)  //Backward
    {
      int speed1 = 0, speed2 = 0;
      speed1 = speed - trim;
      speed2 = speed + trim;
      if (speed1 < 0) speed1 = 0;
      if (speed2 < 0) speed2 = 0;
      if (speed1 > 255) speed1 = 255;
      if (speed2 > 255) speed2 = 255;
//      Serial.println("Backward");
      actstate = rev;  // Set state to modify left & right behavior while moving.
      i2c_Write(M1_PWM, 0);
      i2c_Write(M1_IN, speed1);
      i2c_Write(M2_PWM, speed2);
      i2c_Write(M2_IN, 0);
    } else if (val == 3)  //Left
    {
      i2c_Write(M1_PWM, 150);
      i2c_Write(M1_IN, 0);
      i2c_Write(M2_PWM, 150);
      i2c_Write(M2_IN, 0);
    } else if (val == 4)  //Right
    {
      Serial.println("右转");
      // Car_right();
      i2c_Write(M1_PWM, 0);
      i2c_Write(M1_IN, 150);
      i2c_Write(M2_PWM, 0);
      i2c_Write(M2_IN, 150);
    } 
     else if(val == 5) //Stop
    {
 //     Serial.println("Stop");
      Car_stop();
      actstate = stp;
    }
  } else {
    Serial.println("variable");
    res = -1;
  }

  if (res) { return httpd_resp_send_500(req); }

  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, NULL, 0);
}

static esp_err_t status_handler(httpd_req_t *req) {
  static char json_response[1024];  // Tell Jason his name is spelled wrong.

  sensor_t *s = esp_camera_sensor_get();
  char *p = json_response;
  *p++ = '{';

  p += sprintf(p, "\"framesize\":%u,", s->status.framesize);
  p += sprintf(p, "\"quality\":%u,", s->status.quality);
  *p++ = '}';
  *p++ = 0;
  httpd_resp_set_type(req, "application/json");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, json_response, strlen(json_response));
}

