rco123/esp32AiCar/app_server.h
       >
     <figure>
      <div id="stream-container" class="image-container">
      <img width="400px" height="300px" id="stream" src="">
      </div>
    </figure>
      <section id="buttons">
        <table>
        <tr><td align="center"><button id="forward" onpointerdown="document.dispatchEvent(fwdpress);" onpointerup="document.dispatchEvent(fwdrelease);" onpointerleave="document.dispatchEvent(fwdrelease);">Forward</button></td><td align="center" rowspan="2"><button class="lr" id="turnleft" onpointerdown="document.dispatchEvent(leftpress);" onpointerup="document.dispatchEvent(leftrelease);" onpointerleave="document.dispatchEvent(leftrelease);">Left</button></td><td align="center" rowspan="2"><button class="lr" id="turnright" onpointerdown="document.dispatchEvent(rightpress);" onpointerup="document.dispatchEvent(rightrelease);" onpointerleave="document.dispatchEvent(rightrelease);">Right</button></td></tr>
        <tr><td align="center"><button id="backward"  onpointerdown="document.dispatchEvent(backpress);" onpointerup="document.dispatchEvent(backrelease);" onpointerleave="document.dispatchEvent(backrelease);">Backward</button></td></tr>
        <tr><td align="center">Speed</td><td align="center" colspan="2"><input type="range" id="speed" min="0" max="8" value="8" onchange="try{fetch(document.location.origin+'/control?var=speed&val='+this.value);}catch(e){}"></td></tr>
        <tr><td align="center">Trim</td><td align="center" colspan="2"><input type="range" id="speed" min="-32" max="32" value="0" onchange="try{fetch(document.location.origin+'/control?var=trim&val='+this.value);}catch(e){}"></td></tr>
        <tr><td align="center">Lights</td><td align="center" colspan="2"><input type="range" id="flash" min="0" max="255" value="10" onchange="try{fetch(document.location.origin+'/control?var=flash&val='+this.value);}catch(e){}"></td></tr>
        <tr><td align="center">Quality</td><td align="center" colspan="2"><input type="range" id="quality" min="10" max="63" value="10" onchange="try{fetch(document.location.origin+'/control?var=quality&val='+this.value);}catch(e){}"></td></tr>
        <tr><td align="center">Resolution</td><td align="center" colspan="2"><input type="range" id="framesize" min="0" max="6" value="5" onchange="try{fetch(document.location.origin+'/control?var=framesize&val='+this.value);}catch(e){}"></td></tr>
        </table>
      </section>         
    </section>
    <script>  
   // Functions to control streaming
  var source = document.getElementById('stream');
  source.src = document.location.origin+':81/stream';
  // Functions for Controls via Keypress
  var keyforward=0;
    var keybackward=0; 
    var keyleft=0 ;
    var keyright=0;
  // Emulate Keypress with Touch
  var fwdpress = new KeyboardEvent('keydown', {'keyCode':38, 'which':38});
  var fwdrelease = new KeyboardEvent('keyup', {'keyCode':38, 'which':38});
  var backpress = new KeyboardEvent('keydown', {'keyCode':40, 'which':40});
  var backrelease = new KeyboardEvent('keyup', {'keyCode':40, 'which':40});
  var leftpress = new KeyboardEvent('keydown', {'keyCode':37, 'which':37});
  var leftrelease = new KeyboardEvent('keyup', {'keyCode':37, 'which':37});
  var rightpress = new KeyboardEvent('keydown', {'keyCode':39, 'which':39});
  var rightrelease = new KeyboardEvent('keyup', {'keyCode':39, 'which':39});
  //Keypress Events
   document.addEventListener('keydown',function(keyon){
    keyon.preventDefault();
      if ((keyon.keyCode == '38') && (!keybackward) && (!keyforward)) {keyforward = 1;}
      else if ((keyon.keyCode == '40') && (!keyforward) && (!keybackward)){keybackward = 1;}
      else if ((keyon.keyCode == '37') && (!keyright) && (!keyleft)){keyleft = 1;}
      else if ((keyon.keyCode == '39') && (!keyleft) && (!keyright)){keyright = 1;}
    });
    //KeyRelease Events
    document.addEventListener('keyup',function(keyoff){
      if ((keyoff.keyCode == '38') || (keyoff.keyCode == '40')) {keyforward = 0;keybackward = 0;}
      else if ((keyoff.keyCode == '37') || (keyoff.keyCode == '39')) {keyleft = 0;keyright = 0;}
    });
    //Send Commands to Scout
    var currentcommand=0;
    var oldcommand=0;
    window.setInterval(function(){
      if (((keyforward) && (keyleft)) || ((keybackward) && (keyleft)) || (keyleft)) {currentcommand = 3;} // Turn Left
      else if (((keyforward) && (keyright)) || ((keybackward) && (keyright)) || (keyright)) {currentcommand = 4;} // Turn Right
      else if (keyforward) {currentcommand = 1;} //Set Direction Forward
      else if (keybackward) {currentcommand = 2;} // Set Direction Backward
      else {currentcommand = 5;} // Stop
      if (currentcommand != oldcommand){
        fetch(document.location.origin+'/control?var=car&val='+currentcommand);
        oldcommand = currentcommand;}
    }, 100);
    </script>
    </body>
</html>
)rawliteral";

static esp_err_t index_handler(httpd_req_t *req) {
  httpd_resp_set_type(req, "text/html");
  return httpd_resp_send(req, (const char *)INDEX_HTML, strlen(INDEX_HTML));
}

// Finally, if all is well with the camera, encoding, and all else, here it is, the actual camera server.
// If it works, use your new camera robot to grab a beer from the fridge using function Request.Fridge("beer","buschlite")
void startCameraServer() {

  // 클라이언트 수 세마포어 초기화
  client_count_semaphore = xSemaphoreCreateMutex();

  // 세마포어 초기화
  xSemaphore = xSemaphoreCreateMutex();

  httpd_config_t config = HTTPD_DEFAULT_CONFIG();

  httpd_uri_t index_uri = {
    .uri = "/",
    .method = HTTP_GET,
    .handler = index_handler,
    .user_ctx = NULL
  };

  httpd_uri_t status_uri = {
    .uri = "/status",
    .method = HTTP_GET,
    .handler = status_handler,
    .user_ctx = NULL
  };

  httpd_uri_t cmd_uri = {
    .uri = "/control",
    .method = HTTP_GET,
    .handler = cmd_handler,
    .user_ctx = NULL
  };

  httpd_uri_t capture_uri = {
    .uri = "/capture",
    .method = HTTP_GET,
    .handler = capture_handler,
    .user_ctx = NULL
  };

  httpd_uri_t stream_uri = {
    .uri = "/stream",
    .method = HTTP_GET,
    .handler = stream_handler,
    .user_ctx = NULL
  };

  httpd_uri_t alt_stream_uri = {
        .uri = "/alt_stream",
        .method = HTTP_GET,
        .handler = alt_stream_handler,
        .user_ctx = NULL
    };

  httpd_uri_t ws_uri = {
        .uri = "/ws",
        .method = HTTP_GET,
        .handler = ws_handler,
        .user_ctx = NULL,
        .is_websocket = true
    };  


  Serial.printf("Starting web server on port: '%d'\n", config.server_port);
  if (httpd_start(&camera_httpd, &config) == ESP_OK) {
    httpd_register_uri_handler(camera_httpd, &index_uri);
    httpd_register_uri_handler(camera_httpd, &cmd_uri);
    httpd_register_uri_handler(camera_httpd, &status_uri);
    httpd_register_uri_handler(camera_httpd, &capture_uri);
  }

  config.server_port += 1;
  config.ctrl_port += 1;
  Serial.printf("Starting stream server on port: '%d'\n", config.server_port);
  if (httpd_start(&stream_httpd, &config) == ESP_OK) {
    httpd_register_uri_handler(stream_httpd, &stream_uri);
  }

  config.server_port += 1;
  config.ctrl_port += 1;
  Serial.printf("Starting stream server on port: '%d'\n", config.server_port);
  if (httpd_start(&alt_stream_httpd, &config) == ESP_OK) {
    httpd_register_uri_handler(alt_stream_httpd, &alt_stream_uri);  // 추가된 핸들러
  }

  config.server_port = 90;  // 포트 90번 설정
  config.ctrl_port = 90;
  Serial.printf("Starting stream server on port: '%d'\n", config.server_port);
  if (httpd_start(&ws_httpd, &config) == ESP_OK) {
      // WebSocket 핸들러 등록
      if (httpd_register_uri_handler(ws_httpd, &ws_uri) == ESP_OK) {
          Serial.println("WebSocket server started on /ws");
      } else {
          Serial.println("Failed to register WebSocket handler");
      }
  }


}

#endif
